app/controllers/puzzles_controller.rb

SELECT "puzzles".* FROM "puzzles"
---
  def index
    @puzzles = Puzzle.all

SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."puzzle_id" = $1 ORDER BY "scores"."number" ASC LIMIT $2  [["puzzle_id", 1], ["LIMIT", 10]]
---
  def show
    @puzzle = Puzzle.find(params[:id])
    @scores = @puzzle.scores.order(number: :asc).limit(10)