app/controllers/scores_controller.rb

INSERT INTO "scores" ("number", "player_name", "puzzle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", "0min/s 5.8secs"], ["player_name", "ben"], ["puzzle_id", 1], ["created_at", "2017-07-13 21:46:04.522520"], ["updated_at", "2017-07-13 21:46:04.522520"]]
---
  def create
    @score = Score.new(score_params)
    @score.save